lukasbm/obegransad/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"

# Enable certificate bundle for secure HTTPS requests
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# Enable HTTP client with HTTPS support
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# Http Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# TLS optimizations for better connection reliability
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# WiFi configuration
CONFIG_ESP_WIFI_SCAN_CACHE_SIZE=4
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# esp_timer ISR-dispatch (panel refresh uses ESP_TIMER_ISR for low-jitter ticks)
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y

# v6 treats default compiler warnings as errors; several third-party components
# (panel, managed components) have benign warnings. Keep warnings non-fatal.
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_DEFAULT_LEVEL=4

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Obegransad app configuration (see main/Kconfig.projbuild).
# Set your WiFi SSID below (leave empty to use the captive portal instead).
CONFIG_OBG_WIFI_SSID=""
CONFIG_OBG_WIFI_PASSWORD=""
CONFIG_OBG_TIMEZONE="CET-1CEST,M3.5.0,M10.5.0/3"
CONFIG_OBG_WEATHER_LATITUDE="0.0"
CONFIG_OBG_WEATHER_LONGITUDE="0.0"
CONFIG_OBG_ANNIVERSARY_DAY=1
CONFIG_OBG_ANNIVERSARY_MONTH=1

